//*****************************************************************************
//* Практическая работа № 18                                                  *
//* Выполнил: Пирогов Д., группа 2ИСП                                         *
//* Задание: разработать программу алгоритма решения задачи, используя классы *
//*****************************************************************************

using System;

namespace pr18
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
