//************************************************************************************
//* Практическая работа № 15                                                         *
//* Выполнил: Пирогов Д., группа 2ИСП                                                *
//* Задание: разработать программу алгоритма решения задачи, используя структуры     *
//************************************************************************************

using System;

namespace pr15
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
