//***************************************************************************************************
//* Практическая работа № 16                                                                        *
//* Выполнил: Пирогов Д., группа 2ИСП                                                               *
//* Задание: выполнить операции с объектами файловой системы, используя библиотеки работы с файлами *
//***************************************************************************************************

using System;

namespace pr16
{
    internal class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
